#include <stdio.h>

void countcall() {
    int counter = 0;
    counter++;
    printf("Call Function: Counter = %d\n", counter);
}

int main() {
    printf("Starting function calls...\n");
    countcall();
    printf("After first call:\n");
    countcall();
    return 0;
}

// ผลลัพธ์ที่ได้ต่างกันอย่างไร เพราะเหตุใด
  // แตกต่างกันที่ค่า counter ที่ถูกเก้บไว้ระหว่างการเรียกใช้งานฟังก์ชัน เพราะในกรณีที่ใช้ static int counter จะทำให้ค่าของ counter ถูกเก็บไว้ แต่กรณีที่ใช้ int counter ถูกรีเซ็ตเป็น 0 

// ความแตกต่างของการใช้ static และ non-static Variable
  // การใช้ static จะทำให้ตัวแปรนั้นมีอายุการใช้งานตลอดทั้งโปรแกรม และค่าของมันจะถูกเก็บไว้ระหว่างการเรียกใช้งานฟังก์ชัน ในขณะที่ Non-static จะทำให้ตัวแปรนั้นมีอายุการช้งานเฉพาะในบล็อกที่มันถูกประกาศ
  // และค่าของมันจะถูกรีเว็ตทุกครั้งที่ฟังก์ชันถูกเรียกใช้งาน

// อภิปราย และสรุปผลจากการทดลอง
  // การใช้ static int counter จะทำให้ค่าของ counter ถูกเก็บไว้ระหว่างการใช้งานฟังก์ชัน ทำให้สามารถนับจำนวนครั้งที่ฟังก์ชันถูกเรียกได้อย่างถูกต้อง
  // ในขณะที่การใช้ int coumter จะทำให้ค่าของ counter ถูกรีเซ็ตทุกครั้งที่ฟังก์ชันถูกเรียก ทำให้ไม่สามารถนับจำนวนครั้งที่ฟังก์ชันถูกเรียกได้อย่างถูกต้อง